load_test_results/health_20251217_133701.txt

Summary:
  Total:	1.1855 secs
  Slowest:	0.6736 secs
  Fastest:	0.0127 secs
  Average:	0.0984 secs
  Requests/sec:	84.3552
  
  Total data:	34845 bytes
  Size/request:	348 bytes

Response time histogram:
  0.013 [1]	|■
  0.079 [77]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.145 [11]	|■■■■■■
  0.211 [1]	|■
  0.277 [0]	|
  0.343 [0]	|
  0.409 [0]	|
  0.475 [0]	|
  0.541 [0]	|
  0.608 [8]	|■■■■
  0.674 [2]	|■


Latency distribution:
  10% in 0.0221 secs
  25% in 0.0229 secs
  50% in 0.0336 secs
  75% in 0.0725 secs
  90% in 0.5934 secs
  95% in 0.5936 secs
  99% in 0.6736 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0163 secs, 0.0127 secs, 0.6736 secs
  DNS-lookup:	0.0086 secs, 0.0000 secs, 0.0866 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0011 secs
  resp wait:	0.0820 secs, 0.0127 secs, 0.5050 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	11 responses
  [429]	89 responses