load_test_results/load_test_basic_20251217_133701.txt

Summary:
  Total:	2.8777 secs
  Slowest:	2.2687 secs
  Fastest:	0.0117 secs
  Average:	0.0551 secs
  Requests/sec:	347.4939
  
  Total data:	229845 bytes
  Size/request:	229 bytes

Response time histogram:
  0.012 [1]	|
  0.237 [997]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.463 [0]	|
  0.689 [0]	|
  0.914 [0]	|
  1.140 [0]	|
  1.366 [0]	|
  1.592 [0]	|
  1.817 [1]	|
  2.043 [0]	|
  2.269 [1]	|


Latency distribution:
  10% in 0.0176 secs
  25% in 0.0236 secs
  50% in 0.0303 secs
  75% in 0.0645 secs
  90% in 0.1155 secs
  95% in 0.1337 secs
  99% in 0.1784 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0032 secs, 0.0117 secs, 2.2687 secs
  DNS-lookup:	0.0003 secs, 0.0000 secs, 0.0067 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0470 secs
  resp wait:	0.0503 secs, 0.0116 secs, 2.2686 secs
  resp read:	0.0010 secs, 0.0000 secs, 0.0419 secs

Status code distribution:
  [200]	5 responses
  [429]	995 responses