load_test_results/load_test_url_20251217_133701.txt

Summary:
  Total:	35.0117 secs
  Slowest:	14.4780 secs
  Fastest:	0.0110 secs
  Average:	0.0430 secs
  Requests/sec:	28.5619
  
  Total data:	228228 bytes
  Size/request:	228 bytes

Response time histogram:
  0.011 [1]	|
  1.458 [997]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  2.904 [0]	|
  4.351 [0]	|
  5.798 [0]	|
  7.245 [0]	|
  8.691 [0]	|
  10.138 [0]	|
  11.585 [0]	|
  13.031 [0]	|
  14.478 [1]	|


Latency distribution:
  10% in 0.0149 secs
  25% in 0.0186 secs
  50% in 0.0232 secs
  75% in 0.0303 secs
  90% in 0.0374 secs
  95% in 0.1157 secs
  99% in 0.1175 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0045 secs, 0.0110 secs, 14.4780 secs
  DNS-lookup:	0.0002 secs, 0.0000 secs, 0.0050 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0128 secs
  resp wait:	0.0383 secs, 0.0109 secs, 14.4776 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0036 secs

Status code distribution:
  [200]	11 responses
  [429]	988 responses

Error distribution:
  [1]	Post "https://classification-service-production.up.railway.app/v1/classify": context deadline exceeded (Client.Timeout exceeded while awaiting headers)